awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f090xC.h
/********************************************************************************************************************/
/********************************* CRC ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for CRC_DR register ***********************************************/
#define CRC_DR_DR_Pos                             (0U)
#define CRC_DR_DR_Msk                             (0xFFFFFFFFUL<<CRC_DR_DR_Pos)                     /*!< 0xFFFFFFFF */
#define CRC_DR_DR                                 CRC_DR_DR_Msk                                     /*!< CRC data */

/********************************* Bit definition for CRC_IDR register **********************************************/
#define CRC_IDR_IDR_Pos                           (0U)
#define CRC_IDR_IDR_Msk                           (0xFFFFFFFFUL<<CRC_IDR_IDR_Pos)                   /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR                               CRC_IDR_IDR_Msk                                   /*!< CRC independent data */

/********************************* Bit definition for CRC_CR register ***********************************************/
#define CRC_CR_RESET_Pos                          (0U)
#define CRC_CR_RESET_Msk                          (0x1UL<<CRC_CR_RESET_Pos)                         /*!< 0x00000001 */
#define CRC_CR_RESET                              CRC_CR_RESET_Msk                                  /*!< CRC software reset */
#define CRC_CR_POLYSIZE_Pos                       (3U)
#define CRC_CR_POLYSIZE_Msk                       (0x3UL<<CRC_CR_POLYSIZE_Pos)                      /*!< 0x00000018 */
#define CRC_CR_POLYSIZE                           CRC_CR_POLYSIZE_Msk                               /*!< Polynomial size */
#define CRC_CR_POLYSIZE_0                         (0x1UL<<CRC_CR_POLYSIZE_Pos)                      /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1                         (0x2UL<<CRC_CR_POLYSIZE_Pos)                      /*!< 0x00000010 */
#define CRC_CR_REV_IN_Pos                         (5U)
#define CRC_CR_REV_IN_Msk                         (0x3UL<<CRC_CR_REV_IN_Pos)                        /*!< 0x00000060 */
#define CRC_CR_REV_IN                             CRC_CR_REV_IN_Msk                                 /*!< Reverse input data */
#define CRC_CR_REV_IN_0                           (0x1UL<<CRC_CR_REV_IN_Pos)                        /*!< 0x00000020 */
#define CRC_CR_REV_IN_1                           (0x2UL<<CRC_CR_REV_IN_Pos)                        /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos                        (7U)
#define CRC_CR_REV_OUT_Msk                        (0x1UL<<CRC_CR_REV_OUT_Pos)                       /*!< 0x00000080 */
#define CRC_CR_REV_OUT                            CRC_CR_REV_OUT_Msk                                /*!< Reverse output data */

/********************************* Bit definition for CRC_INIT register *********************************************/
#define CRC_INIT_INIT_Pos                         (0U)
#define CRC_INIT_INIT_Msk                         (0xFFFFFFFFUL<<CRC_INIT_INIT_Pos)                 /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT                             CRC_INIT_INIT_Msk                                 /*!< initial value */

/********************************* Bit definition for CRC_POL register **********************************************/
#define CRC_POL_POL_Pos                           (0U)
#define CRC_POL_POL_Msk                           (0xFFFFFFFFUL<<CRC_POL_POL_Pos)                   /*!< 0xFFFFFFFF */
#define CRC_POL_POL                               CRC_POL_POL_Msk                                   /*!< polynomial  */


/********************************************************************************************************************/
/********************************* DAC ******************************************************************************/
/********************************************************************************************************************/

/********************************* Bit definition for DAC_CR1 register **********************************************/
#define DAC_CR1_EN_Pos                            (0U)
#define DAC_CR1_EN_Msk                            (0x1UL<<DAC_CR1_EN_Pos)                           /*!< 0x00000001 */
#define DAC_CR1_EN                                DAC_CR1_EN_Msk                                    
#define DAC_CR1_BOFF_Pos                          (1U)
#define DAC_CR1_BOFF_Msk                          (0x1UL<<DAC_CR1_BOFF_Pos)                         /*!< 0x00000002 */
#define DAC_CR1_BOFF                              DAC_CR1_BOFF_Msk                                  
#define DAC_CR1_TEN_Pos                           (2U)
#define DAC_CR1_TEN_Msk                           (0x1UL<<DAC_CR1_TEN_Pos)                          /*!< 0x00000004 */
#define DAC_CR1_TEN                               DAC_CR1_TEN_Msk                                   
#define DAC_CR1_TSEL_Pos                          (3U)
#define DAC_CR1_TSEL_Msk                          (0x7UL<<DAC_CR1_TSEL_Pos)                         /*!< 0x00000038 */
#define DAC_CR1_TSEL                              DAC_CR1_TSEL_Msk
#define DAC_CR1_TSEL_0                            (0x1UL<<DAC_CR1_TSEL_Pos)                         /*!< 0x00000008 */
#define DAC_CR1_TSEL_1                            (0x2UL<<DAC_CR1_TSEL_Pos)                         /*!< 0x00000010 */
#define DAC_CR1_TSEL_2                            (0x4UL<<DAC_CR1_TSEL_Pos)                         /*!< 0x00000020 */
#define DAC_CR1_WAVE_Pos                          (6U)
#define DAC_CR1_WAVE_Msk                          (0x3UL<<DAC_CR1_WAVE_Pos)                         /*!< 0x000000C0 */
#define DAC_CR1_WAVE                              DAC_CR1_WAVE_Msk
#define DAC_CR1_WAVE_0                            (0x1UL<<DAC_CR1_WAVE_Pos)                         /*!< 0x00000040 */
#define DAC_CR1_WAVE_1                            (0x2UL<<DAC_CR1_WAVE_Pos)                         /*!< 0x00000080 */
#define DAC_CR1_MAMP_Pos                          (8U)
#define DAC_CR1_MAMP_Msk                          (0xFUL<<DAC_CR1_MAMP_Pos)                         /*!< 0x00000F00 */
#define DAC_CR1_MAMP                              DAC_CR1_MAMP_Msk
#define DAC_CR1_MAMP_0                            (0x1UL<<DAC_CR1_MAMP_Pos)                         /*!< 0x00000100 */
#define DAC_CR1_MAMP_1                            (0x2UL<<DAC_CR1_MAMP_Pos)                         /*!< 0x00000200 */
#define DAC_CR1_MAMP_2                            (0x4UL<<DAC_CR1_MAMP_Pos)                         /*!< 0x00000400 */
#define DAC_CR1_MAMP_3                            (0x8UL<<DAC_CR1_MAMP_Pos)                         /*!< 0x00000800 */
#define DAC_CR1_DMAEN_Pos                         (12U)
#define DAC_CR1_DMAEN_Msk                         (0x1UL<<DAC_CR1_DMAEN_Pos)                        /*!< 0x00001000 */
#define DAC_CR1_DMAEN                             DAC_CR1_DMAEN_Msk                                 
#define DAC_CR1_DMAUDRIE_Pos                      (13U)
#define DAC_CR1_DMAUDRIE_Msk                      (0x1UL<<DAC_CR1_DMAUDRIE_Pos)                     /*!< 0x00002000 */
#define DAC_CR1_DMAUDRIE                          DAC_CR1_DMAUDRIE_Msk                              
#define DAC_CR1_DACCEN_Pos                        (14U)
#define DAC_CR1_DACCEN_Msk                        (0x1UL<<DAC_CR1_DACCEN_Pos)                       /*!< 0x00004000 */
#define DAC_CR1_DACCEN                            DAC_CR1_DACCEN_Msk                                
#define DAC_CR1_BUF_CAL_Pos                       (15U)
#define DAC_CR1_BUF_CAL_Msk                       (0x1UL<<DAC_CR1_BUF_CAL_Pos)                      /*!< 0x00008000 */
#define DAC_CR1_BUF_CAL                           DAC_CR1_BUF_CAL_Msk                               

/********************************* Bit definition for DAC_CR2 register **********************************************/
#define DAC_CR2_SWTRIG_Pos                        (0U)
#define DAC_CR2_SWTRIG_Msk                        (0x1UL<<DAC_CR2_SWTRIG_Pos)                       /*!< 0x00000001 */
#define DAC_CR2_SWTRIG                            DAC_CR2_SWTRIG_Msk                                
#define DAC_CR2_VREFSEL_Pos                       (1U)
#define DAC_CR2_VREFSEL_Msk                       (0x1UL<<DAC_CR2_VREFSEL_Pos)                      /*!< 0x00000002 */
#define DAC_CR2_VREFSEL                           DAC_CR2_VREFSEL_Msk                               
#define DAC_CR2_INTEREN_Pos                       (2U)
#define DAC_CR2_INTEREN_Msk                       (0x1UL<<DAC_CR2_INTEREN_Pos)                      /*!< 0x00000004 */
#define DAC_CR2_INTEREN                           DAC_CR2_INTEREN_Msk                               

/********************************* Bit definition for DAC_DHR12R register *******************************************/
#define DAC_DHR12R_DACDHR_Pos                     (0U)
#define DAC_DHR12R_DACDHR_Msk                     (0xFFFUL<<DAC_DHR12R_DACDHR_Pos)                  /*!< 0x00000FFF */
#define DAC_DHR12R_DACDHR                         DAC_DHR12R_DACDHR_Msk

/********************************* Bit definition for DAC_DHR12L register *******************************************/
#define DAC_DHR12L_DACDHR_Pos                     (4U)
#define DAC_DHR12L_DACDHR_Msk                     (0xFFFUL<<DAC_DHR12L_DACDHR_Pos)                  /*!< 0x0000FFF0 */
#define DAC_DHR12L_DACDHR                         DAC_DHR12L_DACDHR_Msk

