awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f090xC.h
/********************************* Bit definition for PWR_SCR register **********************************************/
#define PWR_SCR_CWUF0_Pos                         (0U)
#define PWR_SCR_CWUF0_Msk                         (0x1UL<<PWR_SCR_CWUF0_Pos)                        /*!< 0x00000001 */
#define PWR_SCR_CWUF0                             PWR_SCR_CWUF0_Msk                                 
#define PWR_SCR_CWUF1_Pos                         (1U)
#define PWR_SCR_CWUF1_Msk                         (0x1UL<<PWR_SCR_CWUF1_Pos)                        /*!< 0x00000002 */
#define PWR_SCR_CWUF1                             PWR_SCR_CWUF1_Msk                                 
#define PWR_SCR_CWUF2_Pos                         (2U)
#define PWR_SCR_CWUF2_Msk                         (0x1UL<<PWR_SCR_CWUF2_Pos)                        /*!< 0x00000004 */
#define PWR_SCR_CWUF2                             PWR_SCR_CWUF2_Msk                                 
#define PWR_SCR_CWUF3_Pos                         (3U)
#define PWR_SCR_CWUF3_Msk                         (0x1UL<<PWR_SCR_CWUF3_Pos)                        /*!< 0x00000008 */
#define PWR_SCR_CWUF3                             PWR_SCR_CWUF3_Msk                                 
#define PWR_SCR_CWUF4_Pos                         (4U)
#define PWR_SCR_CWUF4_Msk                         (0x1UL<<PWR_SCR_CWUF4_Pos)                        /*!< 0x00000010 */
#define PWR_SCR_CWUF4                             PWR_SCR_CWUF4_Msk                                 
#define PWR_SCR_CWUF5_Pos                         (5U)
#define PWR_SCR_CWUF5_Msk                         (0x1UL<<PWR_SCR_CWUF5_Pos)                        /*!< 0x00000020 */
#define PWR_SCR_CWUF5                             PWR_SCR_CWUF5_Msk                                 
#define PWR_SCR_CWUF6_Pos                         (6U)
#define PWR_SCR_CWUF6_Msk                         (0x1UL<<PWR_SCR_CWUF6_Pos)                        /*!< 0x00000040 */
#define PWR_SCR_CWUF6                             PWR_SCR_CWUF6_Msk                                 
#define PWR_SCR_CWUF7_Pos                         (7U)
#define PWR_SCR_CWUF7_Msk                         (0x1UL<<PWR_SCR_CWUF7_Pos)                        /*!< 0x00000080 */
#define PWR_SCR_CWUF7                             PWR_SCR_CWUF7_Msk                                 
#define PWR_SCR_CWUF_Pos                          (0U)
#define PWR_SCR_CWUF_Msk                          (0xFFUL<<PWR_SCR_CWUF_Pos)                          /*!< 0x000000FF */
#define PWR_SCR_CWUF                              PWR_SCR_CWUF_Msk                                   
#define PWR_SCR_CSBF_Pos                          (8U)
#define PWR_SCR_CSBF_Msk                          (0x1UL<<PWR_SCR_CSBF_Pos)                         /*!< 0x00000100 */
#define PWR_SCR_CSBF                              PWR_SCR_CSBF_Msk                                  
#define PWR_SCR_CIWDGRSTWUF_Pos                   (12U)
#define PWR_SCR_CIWDGRSTWUF_Msk                   (0x1UL<<PWR_SCR_CIWDGRSTWUF_Pos)                  /*!< 0x00001000 */
#define PWR_SCR_CIWDGRSTWUF                       PWR_SCR_CIWDGRSTWUF_Msk                          
#define PWR_SCR_CPINRSTWUF_Pos                    (13U)
#define PWR_SCR_CPINRSTWUF_Msk                    (0x1UL<<PWR_SCR_CPINRSTWUF_Pos)                   /*!< 0x00002000 */
#define PWR_SCR_CPINRSTWUF                        PWR_SCR_CPINRSTWUF_Msk                           
#define PWR_SCR_CVCCPORF_Pos                      (14U)
#define PWR_SCR_CVCCPORF_Msk                      (0x1UL<<PWR_SCR_CVCCPORF_Pos)                     /*!< 0x00004000 */
#define PWR_SCR_CVCCPORF                          PWR_SCR_CVCCPORF_Msk                           

/********************************* Bit definition for PWR_PUCRA register ********************************************/
#define PWR_PUCRA_PA_PU0_Pos                      (0U)
#define PWR_PUCRA_PA_PU0_Msk                      (0x1UL<<PWR_PUCRA_PA_PU0_Pos)                     /*!< 0x00000001 */
#define PWR_PUCRA_PA_PU0                          PWR_PUCRA_PA_PU0_Msk                              
#define PWR_PUCRA_PA_PU1_Pos                      (1U)
#define PWR_PUCRA_PA_PU1_Msk                      (0x1UL<<PWR_PUCRA_PA_PU1_Pos)                     /*!< 0x00000002 */
#define PWR_PUCRA_PA_PU1                          PWR_PUCRA_PA_PU1_Msk                              
#define PWR_PUCRA_PA_PU2_Pos                      (2U)
#define PWR_PUCRA_PA_PU2_Msk                      (0x1UL<<PWR_PUCRA_PA_PU2_Pos)                     /*!< 0x00000004 */
#define PWR_PUCRA_PA_PU2                          PWR_PUCRA_PA_PU2_Msk                              
#define PWR_PUCRA_PA_PU3_Pos                      (3U)
#define PWR_PUCRA_PA_PU3_Msk                      (0x1UL<<PWR_PUCRA_PA_PU3_Pos)                     /*!< 0x00000008 */
#define PWR_PUCRA_PA_PU3                          PWR_PUCRA_PA_PU3_Msk                              
#define PWR_PUCRA_PA_PU4_Pos                      (4U)
#define PWR_PUCRA_PA_PU4_Msk                      (0x1UL<<PWR_PUCRA_PA_PU4_Pos)                     /*!< 0x00000010 */
#define PWR_PUCRA_PA_PU4                          PWR_PUCRA_PA_PU4_Msk                              
#define PWR_PUCRA_PA_PU5_Pos                      (5U)
#define PWR_PUCRA_PA_PU5_Msk                      (0x1UL<<PWR_PUCRA_PA_PU5_Pos)                     /*!< 0x00000020 */
#define PWR_PUCRA_PA_PU5                          PWR_PUCRA_PA_PU5_Msk                              
#define PWR_PUCRA_PA_PU6_Pos                      (6U)
#define PWR_PUCRA_PA_PU6_Msk                      (0x1UL<<PWR_PUCRA_PA_PU6_Pos)                     /*!< 0x00000040 */
#define PWR_PUCRA_PA_PU6                          PWR_PUCRA_PA_PU6_Msk                              
#define PWR_PUCRA_PA_PU7_Pos                      (7U)
#define PWR_PUCRA_PA_PU7_Msk                      (0x1UL<<PWR_PUCRA_PA_PU7_Pos)                     /*!< 0x00000080 */
#define PWR_PUCRA_PA_PU7                          PWR_PUCRA_PA_PU7_Msk                              
#define PWR_PUCRA_PA_PU8_Pos                      (8U)
#define PWR_PUCRA_PA_PU8_Msk                      (0x1UL<<PWR_PUCRA_PA_PU8_Pos)                     /*!< 0x00000100 */
#define PWR_PUCRA_PA_PU8                          PWR_PUCRA_PA_PU8_Msk                              
#define PWR_PUCRA_PA_PU9_Pos                      (9U)
#define PWR_PUCRA_PA_PU9_Msk                      (0x1UL<<PWR_PUCRA_PA_PU9_Pos)                     /*!< 0x00000200 */
#define PWR_PUCRA_PA_PU9                          PWR_PUCRA_PA_PU9_Msk                              
#define PWR_PUCRA_PA_PU10_Pos                     (10U)
#define PWR_PUCRA_PA_PU10_Msk                     (0x1UL<<PWR_PUCRA_PA_PU10_Pos)                    /*!< 0x00000400 */
#define PWR_PUCRA_PA_PU10                         PWR_PUCRA_PA_PU10_Msk                             
#define PWR_PUCRA_PA_PU11_Pos                     (11U)
#define PWR_PUCRA_PA_PU11_Msk                     (0x1UL<<PWR_PUCRA_PA_PU11_Pos)                    /*!< 0x00000800 */
#define PWR_PUCRA_PA_PU11                         PWR_PUCRA_PA_PU11_Msk                             
#define PWR_PUCRA_PA_PU12_Pos                     (12U)
#define PWR_PUCRA_PA_PU12_Msk                     (0x1UL<<PWR_PUCRA_PA_PU12_Pos)                    /*!< 0x00001000 */
#define PWR_PUCRA_PA_PU12                         PWR_PUCRA_PA_PU12_Msk                             
#define PWR_PUCRA_PA_PU13_Pos                     (13U)
#define PWR_PUCRA_PA_PU13_Msk                     (0x1UL<<PWR_PUCRA_PA_PU13_Pos)                    /*!< 0x00002000 */
#define PWR_PUCRA_PA_PU13                         PWR_PUCRA_PA_PU13_Msk                             
#define PWR_PUCRA_PA_PU14_Pos                     (14U)
#define PWR_PUCRA_PA_PU14_Msk                     (0x1UL<<PWR_PUCRA_PA_PU14_Pos)                    /*!< 0x00004000 */
#define PWR_PUCRA_PA_PU14                         PWR_PUCRA_PA_PU14_Msk                             
#define PWR_PUCRA_PA_PU15_Pos                     (15U)
#define PWR_PUCRA_PA_PU15_Msk                     (0x1UL<<PWR_PUCRA_PA_PU15_Pos)                    /*!< 0x00008000 */
#define PWR_PUCRA_PA_PU15                         PWR_PUCRA_PA_PU15_Msk                             

/********************************* Bit definition for PWR_PDCRA register ********************************************/
#define PWR_PDCRA_PA_PD0_Pos                      (0U)
#define PWR_PDCRA_PA_PD0_Msk                      (0x1UL<<PWR_PDCRA_PA_PD0_Pos)                     /*!< 0x00000001 */
#define PWR_PDCRA_PA_PD0                          PWR_PDCRA_PA_PD0_Msk                              
#define PWR_PDCRA_PA_PD1_Pos                      (1U)
#define PWR_PDCRA_PA_PD1_Msk                      (0x1UL<<PWR_PDCRA_PA_PD1_Pos)                     /*!< 0x00000002 */
#define PWR_PDCRA_PA_PD1                          PWR_PDCRA_PA_PD1_Msk                              
#define PWR_PDCRA_PA_PD2_Pos                      (2U)
#define PWR_PDCRA_PA_PD2_Msk                      (0x1UL<<PWR_PDCRA_PA_PD2_Pos)                     /*!< 0x00000004 */
#define PWR_PDCRA_PA_PD2                          PWR_PDCRA_PA_PD2_Msk                              
#define PWR_PDCRA_PA_PD3_Pos                      (3U)
#define PWR_PDCRA_PA_PD3_Msk                      (0x1UL<<PWR_PDCRA_PA_PD3_Pos)                     /*!< 0x00000008 */
#define PWR_PDCRA_PA_PD3                          PWR_PDCRA_PA_PD3_Msk                              
#define PWR_PDCRA_PA_PD4_Pos                      (4U)
#define PWR_PDCRA_PA_PD4_Msk                      (0x1UL<<PWR_PDCRA_PA_PD4_Pos)                     /*!< 0x00000010 */
#define PWR_PDCRA_PA_PD4                          PWR_PDCRA_PA_PD4_Msk                              
#define PWR_PDCRA_PA_PD5_Pos                      (5U)
#define PWR_PDCRA_PA_PD5_Msk                      (0x1UL<<PWR_PDCRA_PA_PD5_Pos)                     /*!< 0x00000020 */
#define PWR_PDCRA_PA_PD5                          PWR_PDCRA_PA_PD5_Msk                              
#define PWR_PDCRA_PA_PD6_Pos                      (6U)
#define PWR_PDCRA_PA_PD6_Msk                      (0x1UL<<PWR_PDCRA_PA_PD6_Pos)                     /*!< 0x00000040 */
#define PWR_PDCRA_PA_PD6                          PWR_PDCRA_PA_PD6_Msk                              
#define PWR_PDCRA_PA_PD7_Pos                      (7U)
#define PWR_PDCRA_PA_PD7_Msk                      (0x1UL<<PWR_PDCRA_PA_PD7_Pos)                     /*!< 0x00000080 */
#define PWR_PDCRA_PA_PD7                          PWR_PDCRA_PA_PD7_Msk                              
#define PWR_PDCRA_PA_PD8_Pos                      (8U)
#define PWR_PDCRA_PA_PD8_Msk                      (0x1UL<<PWR_PDCRA_PA_PD8_Pos)                     /*!< 0x00000100 */
#define PWR_PDCRA_PA_PD8                          PWR_PDCRA_PA_PD8_Msk                              
#define PWR_PDCRA_PA_PD9_Pos                      (9U)
#define PWR_PDCRA_PA_PD9_Msk                      (0x1UL<<PWR_PDCRA_PA_PD9_Pos)                     /*!< 0x00000200 */
#define PWR_PDCRA_PA_PD9                          PWR_PDCRA_PA_PD9_Msk                              
#define PWR_PDCRA_PA_PD10_Pos                     (10U)
#define PWR_PDCRA_PA_PD10_Msk                     (0x1UL<<PWR_PDCRA_PA_PD10_Pos)                    /*!< 0x00000400 */
#define PWR_PDCRA_PA_PD10                         PWR_PDCRA_PA_PD10_Msk                             
#define PWR_PDCRA_PA_PD11_Pos                     (11U)
#define PWR_PDCRA_PA_PD11_Msk                     (0x1UL<<PWR_PDCRA_PA_PD11_Pos)                    /*!< 0x00000800 */
#define PWR_PDCRA_PA_PD11                         PWR_PDCRA_PA_PD11_Msk                             
#define PWR_PDCRA_PA_PD12_Pos                     (12U)
#define PWR_PDCRA_PA_PD12_Msk                     (0x1UL<<PWR_PDCRA_PA_PD12_Pos)                    /*!< 0x00001000 */
#define PWR_PDCRA_PA_PD12                         PWR_PDCRA_PA_PD12_Msk                             
#define PWR_PDCRA_PA_PD13_Pos                     (13U)
#define PWR_PDCRA_PA_PD13_Msk                     (0x1UL<<PWR_PDCRA_PA_PD13_Pos)                    /*!< 0x00002000 */
#define PWR_PDCRA_PA_PD13                         PWR_PDCRA_PA_PD13_Msk                             
#define PWR_PDCRA_PA_PD14_Pos                     (14U)
#define PWR_PDCRA_PA_PD14_Msk                     (0x1UL<<PWR_PDCRA_PA_PD14_Pos)                    /*!< 0x00004000 */
#define PWR_PDCRA_PA_PD14                         PWR_PDCRA_PA_PD14_Msk                             
#define PWR_PDCRA_PA_PD15_Pos                     (15U)
#define PWR_PDCRA_PA_PD15_Msk                     (0x1UL<<PWR_PDCRA_PA_PD15_Pos)                    /*!< 0x00008000 */
#define PWR_PDCRA_PA_PD15                         PWR_PDCRA_PA_PD15_Msk                             

/********************************* Bit definition for PWR_PUCRB register ********************************************/
#define PWR_PUCRB_PB_PU0_Pos                      (0U)
#define PWR_PUCRB_PB_PU0_Msk                      (0x1UL<<PWR_PUCRB_PB_PU0_Pos)                     /*!< 0x00000001 */
#define PWR_PUCRB_PB_PU0                          PWR_PUCRB_PB_PU0_Msk                              
#define PWR_PUCRB_PB_PU1_Pos                      (1U)
#define PWR_PUCRB_PB_PU1_Msk                      (0x1UL<<PWR_PUCRB_PB_PU1_Pos)                     /*!< 0x00000002 */
#define PWR_PUCRB_PB_PU1                          PWR_PUCRB_PB_PU1_Msk                              
#define PWR_PUCRB_PB_PU2_Pos                      (2U)
#define PWR_PUCRB_PB_PU2_Msk                      (0x1UL<<PWR_PUCRB_PB_PU2_Pos)                     /*!< 0x00000004 */
#define PWR_PUCRB_PB_PU2                          PWR_PUCRB_PB_PU2_Msk                              
#define PWR_PUCRB_PB_PU3_Pos                      (3U)
#define PWR_PUCRB_PB_PU3_Msk                      (0x1UL<<PWR_PUCRB_PB_PU3_Pos)                     /*!< 0x00000008 */
#define PWR_PUCRB_PB_PU3                          PWR_PUCRB_PB_PU3_Msk                              
#define PWR_PUCRB_PB_PU4_Pos                      (4U)
#define PWR_PUCRB_PB_PU4_Msk                      (0x1UL<<PWR_PUCRB_PB_PU4_Pos)                     /*!< 0x00000010 */
#define PWR_PUCRB_PB_PU4                          PWR_PUCRB_PB_PU4_Msk                              
#define PWR_PUCRB_PB_PU5_Pos                      (5U)
#define PWR_PUCRB_PB_PU5_Msk                      (0x1UL<<PWR_PUCRB_PB_PU5_Pos)                     /*!< 0x00000020 */
#define PWR_PUCRB_PB_PU5                          PWR_PUCRB_PB_PU5_Msk                              
#define PWR_PUCRB_PB_PU6_Pos                      (6U)
#define PWR_PUCRB_PB_PU6_Msk                      (0x1UL<<PWR_PUCRB_PB_PU6_Pos)                     /*!< 0x00000040 */
#define PWR_PUCRB_PB_PU6                          PWR_PUCRB_PB_PU6_Msk                              
#define PWR_PUCRB_PB_PU7_Pos                      (7U)
#define PWR_PUCRB_PB_PU7_Msk                      (0x1UL<<PWR_PUCRB_PB_PU7_Pos)                     /*!< 0x00000080 */
#define PWR_PUCRB_PB_PU7                          PWR_PUCRB_PB_PU7_Msk                              
#define PWR_PUCRB_PB_PU8_Pos                      (8U)
#define PWR_PUCRB_PB_PU8_Msk                      (0x1UL<<PWR_PUCRB_PB_PU8_Pos)                     /*!< 0x00000100 */
#define PWR_PUCRB_PB_PU8                          PWR_PUCRB_PB_PU8_Msk                              
#define PWR_PUCRB_PB_PU9_Pos                      (9U)
#define PWR_PUCRB_PB_PU9_Msk                      (0x1UL<<PWR_PUCRB_PB_PU9_Pos)                     /*!< 0x00000200 */
#define PWR_PUCRB_PB_PU9                          PWR_PUCRB_PB_PU9_Msk                              
#define PWR_PUCRB_PB_PU10_Pos                     (10U)
#define PWR_PUCRB_PB_PU10_Msk                     (0x1UL<<PWR_PUCRB_PB_PU10_Pos)                    /*!< 0x00000400 */
#define PWR_PUCRB_PB_PU10                         PWR_PUCRB_PB_PU10_Msk                             
#define PWR_PUCRB_PB_PU11_Pos                     (11U)
#define PWR_PUCRB_PB_PU11_Msk                     (0x1UL<<PWR_PUCRB_PB_PU11_Pos)                    /*!< 0x00000800 */
#define PWR_PUCRB_PB_PU11                         PWR_PUCRB_PB_PU11_Msk                             
#define PWR_PUCRB_PB_PU12_Pos                     (12U)
#define PWR_PUCRB_PB_PU12_Msk                     (0x1UL<<PWR_PUCRB_PB_PU12_Pos)                    /*!< 0x00001000 */
#define PWR_PUCRB_PB_PU12                         PWR_PUCRB_PB_PU12_Msk                             
#define PWR_PUCRB_PB_PU13_Pos                     (13U)
#define PWR_PUCRB_PB_PU13_Msk                     (0x1UL<<PWR_PUCRB_PB_PU13_Pos)                    /*!< 0x00002000 */
#define PWR_PUCRB_PB_PU13                         PWR_PUCRB_PB_PU13_Msk                             
#define PWR_PUCRB_PB_PU14_Pos                     (14U)
#define PWR_PUCRB_PB_PU14_Msk                     (0x1UL<<PWR_PUCRB_PB_PU14_Pos)                    /*!< 0x00004000 */
#define PWR_PUCRB_PB_PU14                         PWR_PUCRB_PB_PU14_Msk                             
#define PWR_PUCRB_PB_PU15_Pos                     (15U)
#define PWR_PUCRB_PB_PU15_Msk                     (0x1UL<<PWR_PUCRB_PB_PU15_Pos)                    /*!< 0x00008000 */
#define PWR_PUCRB_PB_PU15                         PWR_PUCRB_PB_PU15_Msk                             

/********************************* Bit definition for PWR_PDCRB register ********************************************/
#define PWR_PDCRB_PB_PD0_Pos                      (0U)
#define PWR_PDCRB_PB_PD0_Msk                      (0x1UL<<PWR_PDCRB_PB_PD0_Pos)                     /*!< 0x00000001 */
#define PWR_PDCRB_PB_PD0                          PWR_PDCRB_PB_PD0_Msk                              
#define PWR_PDCRB_PB_PD1_Pos                      (1U)
#define PWR_PDCRB_PB_PD1_Msk                      (0x1UL<<PWR_PDCRB_PB_PD1_Pos)                     /*!< 0x00000002 */
#define PWR_PDCRB_PB_PD1                          PWR_PDCRB_PB_PD1_Msk                              
#define PWR_PDCRB_PB_PD2_Pos                      (2U)
#define PWR_PDCRB_PB_PD2_Msk                      (0x1UL<<PWR_PDCRB_PB_PD2_Pos)                     /*!< 0x00000004 */
#define PWR_PDCRB_PB_PD2                          PWR_PDCRB_PB_PD2_Msk                              
#define PWR_PDCRB_PB_PD3_Pos                      (3U)
#define PWR_PDCRB_PB_PD3_Msk                      (0x1UL<<PWR_PDCRB_PB_PD3_Pos)                     /*!< 0x00000008 */
#define PWR_PDCRB_PB_PD3                          PWR_PDCRB_PB_PD3_Msk                              
#define PWR_PDCRB_PB_PD4_Pos                      (4U)
#define PWR_PDCRB_PB_PD4_Msk                      (0x1UL<<PWR_PDCRB_PB_PD4_Pos)                     /*!< 0x00000010 */
#define PWR_PDCRB_PB_PD4                          PWR_PDCRB_PB_PD4_Msk                              
#define PWR_PDCRB_PB_PD5_Pos                      (5U)
#define PWR_PDCRB_PB_PD5_Msk                      (0x1UL<<PWR_PDCRB_PB_PD5_Pos)                     /*!< 0x00000020 */
#define PWR_PDCRB_PB_PD5                          PWR_PDCRB_PB_PD5_Msk                              
#define PWR_PDCRB_PB_PD6_Pos                      (6U)
#define PWR_PDCRB_PB_PD6_Msk                      (0x1UL<<PWR_PDCRB_PB_PD6_Pos)                     /*!< 0x00000040 */
#define PWR_PDCRB_PB_PD6                          PWR_PDCRB_PB_PD6_Msk                              
#define PWR_PDCRB_PB_PD7_Pos                      (7U)
#define PWR_PDCRB_PB_PD7_Msk                      (0x1UL<<PWR_PDCRB_PB_PD7_Pos)                     /*!< 0x00000080 */
#define PWR_PDCRB_PB_PD7                          PWR_PDCRB_PB_PD7_Msk                              
#define PWR_PDCRB_PB_PD8_Pos                      (8U)
#define PWR_PDCRB_PB_PD8_Msk                      (0x1UL<<PWR_PDCRB_PB_PD8_Pos)                     /*!< 0x00000100 */
#define PWR_PDCRB_PB_PD8                          PWR_PDCRB_PB_PD8_Msk                              
#define PWR_PDCRB_PB_PD9_Pos                      (9U)
#define PWR_PDCRB_PB_PD9_Msk                      (0x1UL<<PWR_PDCRB_PB_PD9_Pos)                     /*!< 0x00000200 */
#define PWR_PDCRB_PB_PD9                          PWR_PDCRB_PB_PD9_Msk                              
#define PWR_PDCRB_PB_PD10_Pos                     (10U)
#define PWR_PDCRB_PB_PD10_Msk                     (0x1UL<<PWR_PDCRB_PB_PD10_Pos)                    /*!< 0x00000400 */
#define PWR_PDCRB_PB_PD10                         PWR_PDCRB_PB_PD10_Msk                             
#define PWR_PDCRB_PB_PD11_Pos                     (11U)
#define PWR_PDCRB_PB_PD11_Msk                     (0x1UL<<PWR_PDCRB_PB_PD11_Pos)                    /*!< 0x00000800 */
#define PWR_PDCRB_PB_PD11                         PWR_PDCRB_PB_PD11_Msk                             
#define PWR_PDCRB_PB_PD12_Pos                     (12U)
#define PWR_PDCRB_PB_PD12_Msk                     (0x1UL<<PWR_PDCRB_PB_PD12_Pos)                    /*!< 0x00001000 */
#define PWR_PDCRB_PB_PD12                         PWR_PDCRB_PB_PD12_Msk                             
#define PWR_PDCRB_PB_PD13_Pos                     (13U)
#define PWR_PDCRB_PB_PD13_Msk                     (0x1UL<<PWR_PDCRB_PB_PD13_Pos)                    /*!< 0x00002000 */
#define PWR_PDCRB_PB_PD13                         PWR_PDCRB_PB_PD13_Msk                             
#define PWR_PDCRB_PB_PD14_Pos                     (14U)
#define PWR_PDCRB_PB_PD14_Msk                     (0x1UL<<PWR_PDCRB_PB_PD14_Pos)                    /*!< 0x00004000 */
#define PWR_PDCRB_PB_PD14                         PWR_PDCRB_PB_PD14_Msk                             
#define PWR_PDCRB_PB_PD15_Pos                     (15U)
#define PWR_PDCRB_PB_PD15_Msk                     (0x1UL<<PWR_PDCRB_PB_PD15_Pos)                    /*!< 0x00008000 */
#define PWR_PDCRB_PB_PD15                         PWR_PDCRB_PB_PD15_Msk                             

