awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/Drivers/CMSIS/Device/PY32F0xx/Include/py32f090xC.h
/********************************* Bit definition for PWR_PUCRC register ********************************************/
#define PWR_PUCRC_PC_PU0_Pos                      (0U)
#define PWR_PUCRC_PC_PU0_Msk                      (0x1UL<<PWR_PUCRC_PC_PU0_Pos)                     /*!< 0x00000001 */
#define PWR_PUCRC_PC_PU0                          PWR_PUCRC_PC_PU0_Msk                              
#define PWR_PUCRC_PC_PU1_Pos                      (1U)
#define PWR_PUCRC_PC_PU1_Msk                      (0x1UL<<PWR_PUCRC_PC_PU1_Pos)                     /*!< 0x00000002 */
#define PWR_PUCRC_PC_PU1                          PWR_PUCRC_PC_PU1_Msk                              
#define PWR_PUCRC_PC_PU2_Pos                      (2U)
#define PWR_PUCRC_PC_PU2_Msk                      (0x1UL<<PWR_PUCRC_PC_PU2_Pos)                     /*!< 0x00000004 */
#define PWR_PUCRC_PC_PU2                          PWR_PUCRC_PC_PU2_Msk                              
#define PWR_PUCRC_PC_PU3_Pos                      (3U)
#define PWR_PUCRC_PC_PU3_Msk                      (0x1UL<<PWR_PUCRC_PC_PU3_Pos)                     /*!< 0x00000008 */
#define PWR_PUCRC_PC_PU3                          PWR_PUCRC_PC_PU3_Msk                              
#define PWR_PUCRC_PC_PU4_Pos                      (4U)
#define PWR_PUCRC_PC_PU4_Msk                      (0x1UL<<PWR_PUCRC_PC_PU4_Pos)                     /*!< 0x00000010 */
#define PWR_PUCRC_PC_PU4                          PWR_PUCRC_PC_PU4_Msk                              
#define PWR_PUCRC_PC_PU5_Pos                      (5U)
#define PWR_PUCRC_PC_PU5_Msk                      (0x1UL<<PWR_PUCRC_PC_PU5_Pos)                     /*!< 0x00000020 */
#define PWR_PUCRC_PC_PU5                          PWR_PUCRC_PC_PU5_Msk                              
#define PWR_PUCRC_PC_PU6_Pos                      (6U)
#define PWR_PUCRC_PC_PU6_Msk                      (0x1UL<<PWR_PUCRC_PC_PU6_Pos)                     /*!< 0x00000040 */
#define PWR_PUCRC_PC_PU6                          PWR_PUCRC_PC_PU6_Msk                              
#define PWR_PUCRC_PC_PU7_Pos                      (7U)
#define PWR_PUCRC_PC_PU7_Msk                      (0x1UL<<PWR_PUCRC_PC_PU7_Pos)                     /*!< 0x00000080 */
#define PWR_PUCRC_PC_PU7                          PWR_PUCRC_PC_PU7_Msk                              
#define PWR_PUCRC_PC_PU8_Pos                      (8U)
#define PWR_PUCRC_PC_PU8_Msk                      (0x1UL<<PWR_PUCRC_PC_PU8_Pos)                     /*!< 0x00000100 */
#define PWR_PUCRC_PC_PU8                          PWR_PUCRC_PC_PU8_Msk                              
#define PWR_PUCRC_PC_PU9_Pos                      (9U)
#define PWR_PUCRC_PC_PU9_Msk                      (0x1UL<<PWR_PUCRC_PC_PU9_Pos)                     /*!< 0x00000200 */
#define PWR_PUCRC_PC_PU9                          PWR_PUCRC_PC_PU9_Msk                              
#define PWR_PUCRC_PC_PU10_Pos                     (10U)
#define PWR_PUCRC_PC_PU10_Msk                     (0x1UL<<PWR_PUCRC_PC_PU10_Pos)                    /*!< 0x00000400 */
#define PWR_PUCRC_PC_PU10                         PWR_PUCRC_PC_PU10_Msk                             
#define PWR_PUCRC_PC_PU11_Pos                     (11U)
#define PWR_PUCRC_PC_PU11_Msk                     (0x1UL<<PWR_PUCRC_PC_PU11_Pos)                    /*!< 0x00000800 */
#define PWR_PUCRC_PC_PU11                         PWR_PUCRC_PC_PU11_Msk                             
#define PWR_PUCRC_PC_PU12_Pos                     (12U)
#define PWR_PUCRC_PC_PU12_Msk                     (0x1UL<<PWR_PUCRC_PC_PU12_Pos)                    /*!< 0x00001000 */
#define PWR_PUCRC_PC_PU12                         PWR_PUCRC_PC_PU12_Msk                             
#define PWR_PUCRC_PC_PU13_Pos                     (13U)
#define PWR_PUCRC_PC_PU13_Msk                     (0x1UL<<PWR_PUCRC_PC_PU13_Pos)                    /*!< 0x00002000 */
#define PWR_PUCRC_PC_PU13                         PWR_PUCRC_PC_PU13_Msk                             
#define PWR_PUCRC_PC_PU14_Pos                     (14U)
#define PWR_PUCRC_PC_PU14_Msk                     (0x1UL<<PWR_PUCRC_PC_PU14_Pos)                    /*!< 0x00004000 */
#define PWR_PUCRC_PC_PU14                         PWR_PUCRC_PC_PU14_Msk                             
#define PWR_PUCRC_PC_PU15_Pos                     (15U)
#define PWR_PUCRC_PC_PU15_Msk                     (0x1UL<<PWR_PUCRC_PC_PU15_Pos)                    /*!< 0x00008000 */
#define PWR_PUCRC_PC_PU15                         PWR_PUCRC_PC_PU15_Msk                             

/********************************* Bit definition for PWR_PDCRC register ********************************************/
#define PWR_PDCRC_PC_PD0_Pos                      (0U)
#define PWR_PDCRC_PC_PD0_Msk                      (0x1UL<<PWR_PDCRC_PC_PD0_Pos)                     /*!< 0x00000001 */
#define PWR_PDCRC_PC_PD0                          PWR_PDCRC_PC_PD0_Msk                              
#define PWR_PDCRC_PC_PD1_Pos                      (1U)
#define PWR_PDCRC_PC_PD1_Msk                      (0x1UL<<PWR_PDCRC_PC_PD1_Pos)                     /*!< 0x00000002 */
#define PWR_PDCRC_PC_PD1                          PWR_PDCRC_PC_PD1_Msk                              
#define PWR_PDCRC_PC_PD2_Pos                      (2U)
#define PWR_PDCRC_PC_PD2_Msk                      (0x1UL<<PWR_PDCRC_PC_PD2_Pos)                     /*!< 0x00000004 */
#define PWR_PDCRC_PC_PD2                          PWR_PDCRC_PC_PD2_Msk                              
#define PWR_PDCRC_PC_PD3_Pos                      (3U)
#define PWR_PDCRC_PC_PD3_Msk                      (0x1UL<<PWR_PDCRC_PC_PD3_Pos)                     /*!< 0x00000008 */
#define PWR_PDCRC_PC_PD3                          PWR_PDCRC_PC_PD3_Msk                              
#define PWR_PDCRC_PC_PD4_Pos                      (4U)
#define PWR_PDCRC_PC_PD4_Msk                      (0x1UL<<PWR_PDCRC_PC_PD4_Pos)                     /*!< 0x00000010 */
#define PWR_PDCRC_PC_PD4                          PWR_PDCRC_PC_PD4_Msk                              
#define PWR_PDCRC_PC_PD5_Pos                      (5U)
#define PWR_PDCRC_PC_PD5_Msk                      (0x1UL<<PWR_PDCRC_PC_PD5_Pos)                     /*!< 0x00000020 */
#define PWR_PDCRC_PC_PD5                          PWR_PDCRC_PC_PD5_Msk                              
#define PWR_PDCRC_PC_PD6_Pos                      (6U)
#define PWR_PDCRC_PC_PD6_Msk                      (0x1UL<<PWR_PDCRC_PC_PD6_Pos)                     /*!< 0x00000040 */
#define PWR_PDCRC_PC_PD6                          PWR_PDCRC_PC_PD6_Msk                              
#define PWR_PDCRC_PC_PD7_Pos                      (7U)
#define PWR_PDCRC_PC_PD7_Msk                      (0x1UL<<PWR_PDCRC_PC_PD7_Pos)                     /*!< 0x00000080 */
#define PWR_PDCRC_PC_PD7                          PWR_PDCRC_PC_PD7_Msk                              
#define PWR_PDCRC_PC_PD8_Pos                      (8U)
#define PWR_PDCRC_PC_PD8_Msk                      (0x1UL<<PWR_PDCRC_PC_PD8_Pos)                     /*!< 0x00000100 */
#define PWR_PDCRC_PC_PD8                          PWR_PDCRC_PC_PD8_Msk                              
#define PWR_PDCRC_PC_PD9_Pos                      (9U)
#define PWR_PDCRC_PC_PD9_Msk                      (0x1UL<<PWR_PDCRC_PC_PD9_Pos)                     /*!< 0x00000200 */
#define PWR_PDCRC_PC_PD9                          PWR_PDCRC_PC_PD9_Msk                              
#define PWR_PDCRC_PC_PD10_Pos                     (10U)
#define PWR_PDCRC_PC_PD10_Msk                     (0x1UL<<PWR_PDCRC_PC_PD10_Pos)                    /*!< 0x00000400 */
#define PWR_PDCRC_PC_PD10                         PWR_PDCRC_PC_PD10_Msk                             
#define PWR_PDCRC_PC_PD11_Pos                     (11U)
#define PWR_PDCRC_PC_PD11_Msk                     (0x1UL<<PWR_PDCRC_PC_PD11_Pos)                    /*!< 0x00000800 */
#define PWR_PDCRC_PC_PD11                         PWR_PDCRC_PC_PD11_Msk                             
#define PWR_PDCRC_PC_PD12_Pos                     (12U)
#define PWR_PDCRC_PC_PD12_Msk                     (0x1UL<<PWR_PDCRC_PC_PD12_Pos)                    /*!< 0x00001000 */
#define PWR_PDCRC_PC_PD12                         PWR_PDCRC_PC_PD12_Msk                             
#define PWR_PDCRC_PC_PD13_Pos                     (13U)
#define PWR_PDCRC_PC_PD13_Msk                     (0x1UL<<PWR_PDCRC_PC_PD13_Pos)                    /*!< 0x00002000 */
#define PWR_PDCRC_PC_PD13                         PWR_PDCRC_PC_PD13_Msk                             
#define PWR_PDCRC_PC_PD14_Pos                     (14U)
#define PWR_PDCRC_PC_PD14_Msk                     (0x1UL<<PWR_PDCRC_PC_PD14_Pos)                    /*!< 0x00004000 */
#define PWR_PDCRC_PC_PD14                         PWR_PDCRC_PC_PD14_Msk                             
#define PWR_PDCRC_PC_PD15_Pos                     (15U)
#define PWR_PDCRC_PC_PD15_Msk                     (0x1UL<<PWR_PDCRC_PC_PD15_Pos)                    /*!< 0x00008000 */
#define PWR_PDCRC_PC_PD15                         PWR_PDCRC_PC_PD15_Msk                             

